{
    "add_bos_token": false,
    "add_eos_token": false,
    "add_prefix_space": false,
    "added_tokens_decoder": {
        "0": {
            "content": "<pad>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "1": {
            "content": "<unk>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "2": {
            "content": "<system>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "3": {
            "content": "<user>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "4": {
            "content": "<assistant>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "5": {
            "content": "</system>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "6": {
            "content": "</user>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        },
        "7": {
            "content": "</assistant>",
            "lstrip": false,
            "normalized": false,
            "rstrip": false,
            "single_word": false,
            "special": true
        }
    },
    "additional_special_tokens": [],
    "bos_token": "<assistant>",
    "clean_up_tokenization_spaces": false,
    "eos_token": "</assistant>", 
    "padding_side": "left", 
    "legacy": false,
    "model_max_length": 32768,
    "pad_token": "<pad>",
    "sp_model_kwargs": {},
    "spaces_between_special_tokens": false,
    "tokenizer_class": "PreTrainedTokenizerFast",
    "unk_token": "<unk>",
    "chat_template": "{% if messages[0]['role'] == 'system' %}{% set system_message = messages[0]['content'] %}{{ '<system>\\n' + system_message + '</system>\\n' }}{% else %}{{ '<system>\\nYou are an helpful assistent, please think step by step and answer the questions.</system>\\n' }}{% endif %}{% for message in messages %}{% set content = message['content'] %}{% if message['role'] == 'user' %}{{ '<user>\\n' + content + '</user>' + '\\n<assistant>\\n' }}{% elif message['role'] == 'assistant' %}{{ content + '</assistant>\\n' }}{% endif %}{% endfor %}"
}